## DataTypes & columns operations

In [9]:
data1={
    'name':['ankit','sachin','sourav'],
    'age':[24,25,32],
    'profession':['sde','data','training'],
    'salary':[2000,3000,4000]
}

In [10]:
data1

{'name': ['ankit', 'sachin', 'sourav'],
 'age': [24, 25, 32],
 'profession': ['sde', 'data', 'training'],
 'salary': [2000, 3000, 4000]}

In [11]:
import pandas as pd

In [12]:
df1=pd.DataFrame(data1)

In [13]:
df1.dtypes

name          object
age            int64
profession    object
salary         int64
dtype: object

In [14]:
df1['age'].astype('float64')

0    24.0
1    25.0
2    32.0
Name: age, dtype: float64

## create columns

In [18]:
df1['bonus']=df1['salary']*0.15

In [19]:
df1

     name  age profession  salary  bonus
0   ankit   24        sde   300.0   45.0
1  sachin   25       data   450.0   67.5
2  sourav   32   training   600.0   90.0

In [33]:
df1=df1.assign(
    tax=df1['salary']*0.1
)

In [34]:
df1

     name  age profession  salary  bonus   tax
0   ankit   24        sde   300.0   45.0  30.0
1  sachin   25       data   450.0   67.5  45.0
2  sourav   32   training   600.0   90.0  60.0

## Drop columns

In [40]:
df1=df1.drop(['bonus','tax'],axis=1)

## Drop rows

In [41]:
df1

     name  age profession  salary
0   ankit   24        sde   300.0
1  sachin   25       data   450.0
2  sourav   32   training   600.0

In [42]:
df1.drop(0,axis=0)

     name  age profession  salary
1  sachin   25       data   450.0
2  sourav   32   training   600.0

In [46]:
df1.drop([1,2],axis=0)

    name  age profession  salary
0  ankit   24        sde   300.0

## Sorting

In [54]:
df1

     name  age profession  salary
0   ankit   24        sde   300.0
1  sachin   25       data   450.0
2  sourav   32   training   600.0

In [49]:
df1.sort_values('salary',ascending=False)

     name  age profession  salary
2  sourav   32   training   600.0
1  sachin   25       data   450.0
0   ankit   24        sde   300.0

In [56]:
df1.sort_values(['salary','age'],ascending=[False,False])

     name  age profession  salary
2  sourav   32   training   600.0
1  sachin   25       data   450.0
0   ankit   24        sde   300.0